从外围循环或代码块里返回
从外围循环返回
while (line = gets.chop)
	break if line == "quit"
	puts eval(line)
end
puts "Good bye"
------------------------------------------------------------------------------------------------------------------------------------------------------
从代码块里返回
f.each do |line|
	break if line == "quit\n"
	puts eval(line)
end
puts "Good bye"
------------------------------------------------------------------------------------------------------------------------------------------------------
break如果没有返回值则返回nil
如果有一个返回值则返回
如果有多个逗号分隔的返回值则返回一个数组
