#
# ==============
# |  Math模块  |
# ==============
#
# 1. 常量(Constants)
# ~~~~~~~~~~~~~~~~~~
Math::PI    # => 3.14159265358979
Math::E     # => 2.71828182845905

# 2. 平方根(Roots)
# ~~~~~~~~~~~~~~~~
Math.sqrt(25.0) # => 5.0
27.0**(1.0/3.0) # => 3.0

# 3. 对数(Logarithms)
# ~~~~~~~~~~~~~~~~~~~
Math.log10(100.0)     # => 2.0 以10为底的对数
Math.log(Math::E**3)  # => 3.0 以e为底的对数
Math.log2(8)          # => 3.0 以2为底的对数
Math.log(16,4)        # => 2.0 以4为底的对数 

# 4. 三角函数(Trigonometry)
# ~~~~~~~~~~~~~~~~~~~~~~~~~
include Math 
sin(PI/2)
cos(0)
tan(PI/4)
asin(1.0)/PI 
#-------------------------------------------------------------------------------
