# =======================
# |  区间(Range)的特性  |
# =======================
# 1. 序列(sequences)
# 2. 条件(conditionals)
# 3. 间隔(intervals)
# ------------------------------------------------------------------------------
# ===============================
# |  区间作为序列（sequences）  |
# ===============================
# 1. 转换为list
# ~~~~~~~~~~~~~
(1..10).to_a          # => [1,2,3,4,5,6,7,8,9,10]
("bar".."bat")        # => ["bar","bas","bat"]

# 2. 测试区间
# ~~~~~~~~~~~
digits = 0..9 
digits.include?(5)        # => true 
digits.min                # => 0
digits.max                # => 9
digits.reject {|x| x < 5} # => [5,6,7,8,9]
# ------------------------------------------------------------------------------
# ==================================
# |  区间作为条件（conditionals）  |
# ==================================
# 它们表现的向某种双向开关，
# 当区间的第一部分的条件为true时，它们就打开，
# 当区间的第二部分的条件为true时，它们就关闭。
while line = gets 
  puts line if line =~ /start/ .. line =~ /end/
end 
# ------------------------------------------------------------------------------
# ==================
# |  区间作为间隔  |
# ==================
# 测试一些值是否会落入区间的表达的间隔内。
(1..10) === 5         # => true 
(1..10) === 15        # => false 
(1..10) === 3.1415926 # => true 
('a'..'j') === 'c'    # => true 
('a'..'j') === 'z'    # => false 
